package geekbrains.eighthVebinar;


import java.util.Locale;

public class Application {

    public static void main(String[] args) {

        Frame frame = new Frame();

    }
}
/*
Сделал все пункты, а также добавил кнопки очистки поля и нахождения квадратного корня из числа, НО
есть баг. Если попробовать написать уравнение типа 5*6/10, что должно быть равно 3, то калькулятор выдаст
результат (1.1). То есть он сложит 5 и 6, а затем поделит на 10.
У меня не получилось пока что это фиксануть.
* */

// Спасибо за прекрасное преподавание!=)